Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: The circle’s radius equals half the length of the frame rectangle’s smallest edge.
ja: 円のもつ半径は、枠矩形のもつ最も小さい縁の長さの半分に等しいです。

source: The circle’s size resets to its original size when the gesture finishes.
ja: 円のもつ大きさは、ジェスチャが終了する時にそれの元の大きさに再設定されます。

source: The clipping shape itself isn’t visible.
ja: 切り抜き形状それ自体は、可視ではありません。

source: The clipping shape to use for this view.
ja: このビューに使う切り抜き形状。

source: The closure has no parameters, and returns a value.
ja: そのクロージャは、パラメータを持ちません、そしてある値を返します。

source: The closure has the following parameter:
ja: そのクロージャは、以下のパラメータを持ちます：

source: The closure has the following parameters:
ja: クロージャは、以下のパラメータを持ちます：

source: The closure is called again repeatedly with the previous call’s return value and each element of the sequence.
ja: クロージャは、直前の呼び出しの戻り値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure is called again repeatedly with the updated accumulating value and each element of the sequence.
ja: クロージャは、更新された蓄積値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure provides a single newValue parameter that indicates the changed value.
ja: クロージャは、単一のnewValueパラメータを提供します、それは変更された値を指し示します。

source: The closure takes two arguments that represent the offset relative to the dynamic view’s underlying collection of data.
ja: クロージャは２つの引数をとります、それは動的ビューのもつ基礎をなすデータのコレクションに相対的なオフセットを表します。

source: The closure takes two arguments: The first argument is the offset relative to the dynamic view’s underlying collection of data.
ja: クロージャは２つの引数をとります：最初の引数は、動的ビューのもつ基礎をなすデータのコレクションに相対的なオフセットです。

source: The code above uses an unusually large amount of tracking to make it easy to see the effect.
ja: 上のコードは、普通でない大きな量のトラッキングを使って、簡単に効果がわかるようにしています。

source: The code below converts the underlying gesture states into the high-level DragState enumeration defined above.
ja: 下のコードは、基礎をなすジェスチャ状態を、上で定義される高水準DragState列挙へと変換します。

source: The collation associated with the locale.
ja: そのロケールと関連した照合。

source: The collation identifier for the locale.
ja: そのロケールに対する照合識別子。

source: The collection of underlying data.
ja: 基礎をなすデータのコレクション。

source: The collection of underlying identified data that SwiftUI uses to create views dynamically.
ja: 基礎をなす識別されたデータのコレクション、それはSwiftUIが使用してビューを動的に作成するものです。

source: The collection of underlying identified data.
ja: 基礎をなす識別されたデータからなるコレクション。

source: The collection’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: コレクションの「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The color for the stop.
ja: その経由に対する色。

source: The color of the strikethrough.
ja: 取り消し線の色。

source: The color of the underline.
ja: 下線の色。

source: The color or gradient with which to stroke this shape.
ja: それでこの形状に線をつける色または勾配。

source: The color scheme enumerates the user setting options for Light or Dark Mode.
ja: カラースキームは、LightまたはDark Modeに対するユーザ設定オプションを列挙します。

source: The color scheme for this view.
ja: このビューに対するカラースキーム。

source: The color scheme of this environment.
ja: この環境のカラースキーム。

source: The color to bias this view toward.
ja: このビューをそれへと偏らせることになる色。

source: The color to use as an accent color.
ja: アクセントカラーとして使う色。

source: The color to use when displaying this text.
ja: このテキストを表示する時に使う色。

source: The column number of the XML document being processed by the parser.
ja: パーサーによって処理されているXML書類のコラム数。

source: The comparison does not consider the parent node (and hence the node’s location).
ja: 比較は、親ノードを考慮しません（そしてそれゆえそのノードのもつ位置を）。

source: The comparison looks at the node and its children, but does not include the node’s parent.
ja: 比較は、ノードとそれの子を見ます、しかしノードのもつ親を含めません。

source: The components used for hashing must be the same as the components compared in your type’s == operator implementation.
ja: ハッシュ化に使用される構成要素は、あなたの型の持つ==演算子実装において比較される構成要素と同じでなければなりません。

source: The composition of commands that comprise the command group.
ja: そのコマンドグループを作り上げるコマンドの構成。

source: The configuration and content of a widget to display on the Home screen or in Notification Center.
ja: ホーム画面上でまたは通知センターにおいて表示する、ウィジェットの構成設定および内容。

source: The content and behavior of the gesture.
ja: ジェスチャの内容と挙動。

source: The content and behavior of the scroll view.
ja: スクロールビューの内容と挙動。

source: The content and behavior of the view.
ja: ビューの内容と挙動。

source: The content is displayed by the Touch Bar when appropriate, depending on focus.
ja: 内容は、Touch Barによって、適切な時に、フォーカスに依存して表示されます。

source: The content of the list.
ja: リストの内容。

source: The content view type.
ja: コンテンツビュー型。

source: The context in which updates to an associated AppKit view controller take place.
ja: それにおいて更新がある結びつけられたAppKitビューコントローラに発生する前後関係。

source: The context in which updates to an associated AppKit view take place.
ja: それにおいて、ある結びつけられたAppKitビューに更新が発生する前後関係。

source: The context in which updates to an associated UIKit view controller take place.
ja: それにおいて、ある結びつけられたUIKitビューコントローラに更新が発生する前後関係。

source: The context in which updates to an associated UIKit view take place.
ja: それにおいて、ある結びつけられたUIKitビューに更新が発生する前後関係。

source: The context in which updates to an associated WatchKit interface object take place.
ja: それにおいて関連WatchKitオブジェクトに対する更新が行われるところの文脈。

source: The context of the current state-processing update.
ja: 現在の状態経過の最新情報の前後関係。

source: The contrast associated with the color scheme of this environment.
ja: この環境のカラースキームと結び付けられたコントラスト。

source: The coordinate space in which to receive location values.
ja: それにおいて場所値を受け取ることになる座標空間。

source: The coordinate space of the dragging gesture’s location.
ja: ドラッグジェスチャのもつ位置の座標空間。

source: The coordinator is a custom instance you define.
ja: コーディネータは、あなたが定義するあつらえのインスタンスです。

source: The coordinator is a custom object you define.
ja: コーディネータは、あなたが定義するあつらえのオブジェクトです。

source: The correct image or color displays automatically for the current environment.
ja: 正しい画像または色が自動的に現在の環境に対して表示されます。

source: The corresponding value is a localized string representation containing the reason for the failure that, if present, will be returned by localizedFailureReason.
ja: 対応する値は、localizedFailureReasonによって返される失敗に対する理由を含んでいるローカライズされた文字列表現です。

source: The corresponding value is a localized string representation of the error that, if present, will be returned by localizedDescription.
ja: 対応する値は、もし存在するならば、localizedDescriptionによって返されるエラーのローカライズされた文字列表現です。

source: The corresponding value is a string containing the localized recovery suggestion for the error.
ja: 対応する値は、エラーに対するローカライズされた復旧提案を含んでいる文字列です。

source: The corresponding value is an NSNumber object containing the NSStringEncoding value.
ja: 対応する値は、NSNumberオブジェクトでNSStringEncoding値を含んでいます。

source: The corresponding value is an NSString containing the localized help corresponding to the help button.
ja: 対応する値は、ヘルプボタンに対応するローカライズれさたヘルプを含んでいるNSStringです。

source: The corresponding value is an NSURL object.
ja: 対応する値は、NSURLオブジェクトです。

source: The corresponding value is an array containing the localized titles of buttons appropriate for displaying in an alert panel.
ja: 対応する値は、警告パネルにおいて表示するのに適したローカライズされたボタンのタイトルを含んでいる配列です。

source: The corresponding value is an error that was encountered in an underlying implementation and caused the error that the receiver represents to occur.
ja: 対応している値は、あるエラーです、それは基礎をなす実装において出くわされた、そしてレシーバが表すエラーが発生する原因となったものです。

source: The corresponding value is an object that conforms to the NSErrorRecoveryAttempting informal protocol.
ja: 対応している値は、NSErrorRecoveryAttempting非形式プロトコルに準拠するオブジェクトです。

source: The creation and update processes parallel the behavior of SwiftUI views, and you use them to configure your interface object with your app's current state information.
ja: 作成および更新処理は、SwiftUIビューの挙動と並行して進みます、そしてあなたはそれらを使って、あなたのインターフェイスオブジェクトをあなたのアプリのもつ現在の状態情報で構成設定します。

source: The creation and update processes parallel the behavior of SwiftUI views, and you use them to configure your view controller with your app's current state information.
ja: 作成および更新処理は、SwiftUIビューの挙動と並行して進みます、そしてあなたはそれらを使って、あなたのビューコントローラをあなたのアプリのもつ現在の状態情報で構成設定します。

source: The creation and update processes parallel the behavior of SwiftUI views, and you use them to configure your view with your app's current state information.
ja: 作成および更新処理は、SwiftUIビューの挙動と並行して進みます、そしてあなたはそれらを使って、あなたのビューをあなたのアプリのもつ現在の状態情報で構成設定します。

source: The currency code associated with the locale.
ja: そのロケールと関連した国コード。

source: The currency symbol associated with the locale.
ja: そのロケールと関連した通貨記号。

source: The current calendar that views should use when handling dates.
ja: 現在のカレンダー、それはビューが日付を取り扱うときに使うべきものです。

source: The current document for a given editor instance is also provided as an environment object for its subhierarchy.
ja: 与えられたエディタインスタンスに対する現在の書類はまた、それの会階層に対する環境オブジェクトとして提供されます。

source: The current environment.
ja: 現在の環境。

source: The current locale that views should use.
ja: 現在のロケール、それはビューが使用すべきものです。

source: The current state of a drop.
ja: あるドロップの現在の状態。

source: The current state of the event sequence.
ja: イベントシーケンスの現在の状態。

source: The current time zone that views should use when handling dates.
ja: 現在のタイムゾーン、それはビューが日付を取り扱うときに使うべきものです。

source: The current transaction.
ja: 現在のトランザクション。

source: The custom coordinator instance you use to communicate changes back to SwiftUI.
ja: あなたが変更を逆にSwiftUIへと伝えるために使用するあつらえのコーディネータインスタンス。

source: The custom coordinator you use to communicate changes back to SwiftUI.
ja: あなたが変更を逆にSwiftUIへと伝えるために使用するあつらえのコーディネータ。

source: The dark regions in a view become transparent, and the bright regions become opaque black.
ja: ビューの中の暗い領域は透明になります、そして明るい領域は不透明の黒になります。

source: The data for populating the list.
ja: リストに満たすためのデータ。

source: The data that passes through the pipe is buffered; the size of the buffer is determined by the underlying operating system.
ja: パイプを通過するデータは、バッファされます； パッファの大きさは、基礎をなすオペレーティングシステムによって決定されます。

source: The data that the ForEach instance uses to create views dynamically.
ja: ForEachインスタンスが使用してビューを動的に作成するデータ。

source: The data to animate.
ja: アニメーション化するデータ。

source: The data to be animated.
ja: アニメーション化されるデータ。

source: The decimal separator associated with the locale.
ja: そのロケールと関連した小数分離子。

source: The decoder to use during initialization.
ja: 初期化の間に使うデコーダ。

source: The default List style.
ja: 省略時のList様式。

source: The default DatePicker style.
ja: 省略時のDatePickerスタイル。

source: The default axis is the vertical axis.
ja: 省略時の軸は、垂直軸です。

source: The default behavior does nothing.
ja: 省略時の挙動は何もしません。

source: The default button style, based on the button’s context.
ja: 省略時のボタンスタイル、ボタンのもつ文脈に基づきます。

source: The default font of this environment.
ja: この環境の省略時のフォント。

source: The default font to use in the view.
ja: ビューにおいて使う省略時のフォント。

source: The default height of an item in a wheel-style picker, such as a date picker.
ja: ホイールスタイルのピッカー、たとえば日付ピッカーなどの中のある項目の省略時の高さ。

source: The default height of an item in a wheel-style picker.
ja: 環形式ピッカーにおける項目の省略時の高さ。

source: The default implementation does nothing.
ja: 省略時の実装は何もしません。

source: The default implementation of this method returns nil, which tells the drop to use the last valid returned value or else DropOperation.copy.
ja: このメソッドの省略時の実装はnilを返します、それは、最後の有効な戻り値かさもなければDropOperation.copyを使うようドロップに伝えます。

source: The default implementation of this method throws an exception.
ja: このメソッドの省略時の実装は例外をスローします。

source: The default implementation returns 0.
ja: 省略時の実装は、0 を返します。

source: The default implementation returns true.
ja: 省略時の実装は、trueを返します。

source: The default is ControlActiveState.key.
ja: 省略時は、ControlActiveState.keyです。

source: The default is ControlSize.regular.
ja: 省略時は、ControlSize.regularです。

source: The default is 1.0.
ja: 省略時は1.0です。

source: The default is nil.
ja: 省略時にはnilです。

source: The default is 1.
ja: 省略時は1です。

source: The default minimum height of a header in a list.
ja: あるリストの中のあるヘッダの省略時の最小限の高さ。

source: The default minimum height of a row in a list.
ja: あるリストの中の横列の省略時の最小限の高さ。

source: The default picker style may also take into account other factors — like whether the picker appears in a container view — when setting the appearance of a picker.
ja: 省略時のピッカースタイルはまた、他の因子 — ピッカーがコンテナビューの中に現れるかどうかのような — をピッカーの外観を設定している時に考慮するかもしれません。

source: The default picker style, based on the picker’s context.
ja: 省略時のピッカースタイル、そのピッカーのもつ文脈に基づいて。

source: The default priority is 0.
ja: 省略時の優先度は、0です。

source: The default separator is an empty string.
ja: 省略時の分離子は空の文字列です。

source: The default set of characters to skip is the whitespace and newline character set.
ja: スキップする省略時の文字集合は、空白および改行文字集合です。

source: The default sort priority is zero.
ja: 省略時のソート優先順位はゼロです。

source: The default toggle style.
ja: 省略時のトグルスタイル。

source: The default value for the environment key.
ja: その環境キーに対する省略時の値。

source: The default value for this parameter is true.
ja: このパラメータに対する省略時の値は、trueです。

source: The default value if an integer value is not specified for the given key.
ja: default値、もしある整数値がこの与えられたキーに対して指定されないならば。

source: The default value is ContentSizeCategory.large.
ja: 省略時の値は、ContentSizeCategory.largeです。

source: The default value is Text.TruncationMode.tail.
ja: 省略時の値はText.TruncationMode.tailです。

source: The default value is false.
ja: 省略時の値は、falseです。

source: The default value is nil, which means the system automatically chooses an appropriate value.
ja: 省略時の値はnilです、それはシステムが自動的に適切な値を選ぶのを意味します。

source: The default value is nil.
ja: 省略時の値は、nilです。

source: The default value is true.
ja: 省略時の値は、trueです。

source: The default value is 1.
ja: 省略時の値は、1です。

source: The default value is Int.max.
ja: 省略時の値は、Int.maxです。

source: The default value is a one-degree angle.
ja: 省略時の値は、一度角です。

source: The default value of the preference.
ja: この環境設定の省略時の値。

source: The definition of temporary might vary by platform or specific control.
ja: 一時的の定義は、プラットホームまたは特定コントロールによって異なるかもしれません。

source: The difference needed to produce the reciever’s state from the parameter’s state.
ja: レシーバのもつ状態をパラメータのもつ状態から生み出すのに必要とされる差異。

source: The difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付き要素をこの与えられたコレクションから生成するのに必要な差異。

source: The display scale of this environment.
ja: この環境の表示縮尺。

source: The distance between start and end.
ja: startとendの隔たり。

source: The distance between adjacent subviews, or nil if you want the stack to choose a default distance for each pair of subviews.
ja: 隣り合ったサブビューの間の間隔、またはnil、もしあなたがスタックに省略時の間隔をサブビューの各対のために選んでほしいならば。

source: The distance in points between the bottom of one line fragment and the top of the next.
ja: １行断片の下部と次のものの上部との間のポイントでの間隔。

source: The distance that must be dragged before the gesture starts.
ja: ジェスチャが開始する前にドラッグされなければならない間隔。

source: The distance to offset i.
ja: iを補う間隔。

source: The distance to offset this view.
ja: このビューを補う間隔。

source: The drop activity is not allowed at this time or location.
ja: ドロップアクティビティは、この時間または場所で許可されません。

source: The drop operation that the drop proposes to perform.
ja: そのドロップが実行を申し込むドロップ操作。

source: The edge of the attachmentAnchor where the popover’s arrow is located.
ja: attachmentAnchorの縁、そこにおいてポップオーバーのもつ矢印が設置されます。

source: The edges to inset.
ja: 差し込む縁。

source: The effect of tracking resembles that of the kerning(_:) modifier, but adds or removes trailing whitespace, rather than changing character offsets.
ja: トラッキングの効果は、kerning(_:)修飾子のそれに似ています、しかし後に続く空白を追加または除去します、文字オフセットを変更するのではなく。

source: The effects of a modifier typically propagate to any child views that don’t explicitly override the modifier.
ja: ある修飾子の効果は概して、その修飾子を明示的にオーバーライドしないあらゆる子ビューに伝播します。

source: The element nodes in an XML tree structure.
ja: XMLツリー構造の中の要素ノード。

source: The element of the set to remove.
ja: 除去されることになる集合の要素。

source: The element that should be split upon.
ja: それで分離されることになる要素。

source: The element to find in the sequence.
ja: このシーケンスにおいて見つける要素。

source: The element to insert.
ja: 挿入される要素。

source: The element to look for in the option set.
ja: オプションセットにおいて捜される要素。

source: The elements of the resulting array are ordered according to the given predicate.
ja: 結果の配列の要素は、与えられた述部にしたがって並べられます。

source: The elements to use as members of the new set.
ja: 新しい集合の要素として使うための要素。

source: The empty, or identity, modifier.
ja: 空の、または同一性、修飾子。

source: The enclosing HStack instance, shown in gray, ensures all the text views remain aligned at their top edge, regardless of the offset.
ja: 取り囲んでいるHStackインスタンスは、灰色で示され、全てのテキストビューがそれらの上端で揃えられたままであるのを保証します、その相殺に関係なく。

source: The end quotation symbol associated with the locale.
ja: そのロケールと関連した終わり引用記号。

source: The end-point of the curve becomes the new current point.
ja: カーブの終点は、新しい現在の地点になります。

source: The entry of proper names and street addresses are examples where autocorrection can negatively affect the user’s ability complete a data entry task.
ja: 固有名詞および街路住所の登録は代表例です、そこにおいて自動修正はデータ登録タスクを完了するユーザの能力に悪い影響を及ぼしえます。

source: The example below creates a color well using a Binding and title you provide:
ja: 以下の例は、あるカラーウェルをBindingとあなたが提供するタイトルを使って作成します：

source: The example below demonstrates how a nested view can find and operate on its enclosing view’s coordinate space:
ja: 下の例は、どのようにある入れ子にされたビューがそれのまわりを囲んでいるビューのもつ座標空間を見つけてそれで演算するかを実演します：

source: The example below provides Touch Bar content in-line, that creates the content the Touch Bar displays:
ja: 下の例は、Touch Bar内容をインラインに提供します、それはTouch Barが表示する内容を作成します：

source: The example below rotates the text 30˚ around the z axis, which is the axis pointing out of the screen:
ja: 下の例は、テキストを30˚、z軸に沿って回転します、それは画面の中から外に向いている軸です。

source: The example below sets the last button as the principal button for the Touch Bar view.
ja: 下の例は、最後のボタンを主役ボタンとしてTouch Barビューに対して設定します。

source: The example below shows a series of squares filled with a linear gradient.
ja: 下の例は、線形勾配で満たされた一連の正方形を示します。

source: The exemplar character set for the locale.
ja: そのロケールの典型文字集合。

source: The fastest encoding to which the receiver may be converted without loss of information.
ja: レシーバが情報の損失なしに変換されるであろう最速の符号化。

source: The fetch request and its results use the managed object context provided by the environment value managedObjectContext.
ja: フェッチリクエストとそれの結果は、環境値managedObjectContextによって提供される管理オブジェクト文脈を使います。

source: The fetched results of the fetch request.
ja: フェッチリクエストのフェッチした（取って来た）結果。

source: The fill style to use when rasterizing shape.
ja: shapeをラスタライズするときに使う埋め尽くし形式。

source: The final accumulated value.
ja: 最終的に蓄積された値。

source: The final example passes false for the omittingEmptySubsequences parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はfalseをomittingEmptySubsequencesパラメータに対して渡します、それで返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The first and last are larger than the second, with padding inside the border above the word "Hello" in the first case, and padding inside the border below the word in the last case.
ja: 最初と最後は２番目よりも大きいです、最初の場合には単語 "Hello" の上の境界の内側に詰め物をすること、最後の場合には単語の下の境界の内側に詰め物をすることで。

source: The first element of the collection.
ja: コレクションの最初の要素。

source: The first element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最初の要素、またはpredicateを満たす要素が無いならばnil。

source: The first gesture has ended.
ja: 最初のジェスチャは、終わっています。

source: The first gesture hasn’t ended.
ja: 最初のジェスチャは、終わっていません。

source: The first gesture in a sequence of two gestures.
ja: 連続する２つのジェスチャにおける最初のジェスチャ。

source: The first gesture of the sequence.
ja: その連続の最初のジェスチャ。

source: The first gesture’s value.
ja: 最初のジェスチャのもつ値。

source: The first index where element is found.
ja: elementが見つけられたところの最初のインデックス。

source: The first of two gestures succeeded.
ja: うまくいった２つのジェスチャの最初のもの。

source: The first of two gestures that can happen simultaneously.
ja: 同時に起こることが可能な２つのゼスチャの最初のもの。

source: The first of two gestures.
ja: ２つのジェスチャの最初のもの。

source: The first parameter to action contains the dropped items, with types specified by supportedTypes.
ja: actionへの最初のパラメータは、supportedTypesで指定された型をもつ、ドロップされた項目いくつかを含みます。

source: The first text view to compare.
ja: 比較する第一のテキスト。

source: The first text view with text to combine.
ja: 結合するテキストをもつ最初のテキストビュー。

source: The first truncation mode to compare.
ja: 比較する第一の切り詰めモード。

source: The first use of split returns each word that was originally separated by one or more spaces.
ja: splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The first value to add.
ja: 加算する第１の値。

source: The first value.
ja: 最初の値。

source: The first view, with a negative offset, grows downward to handle the lowered text.
ja: 最初のビューは、負の相殺をもち、下に増大して位置を低くしたテキストを取り扱います。

source: The floating point value representing the amount of magnification for the magnification gesture.
ja: 拡大ジェスチャに対する拡大量を表している浮動小数点値。

source: The focus environment.
ja: フォーカス環境。

source: The following code adds a tap gesture to a Circle that toggles the color of the circle.
ja: 以下のコードは、あるタップゼスチャをCircleに加えます、それは円の色を２値の間で切り替えます。

source: The following code applies a corner radius of 20 to a square image:
ja: 以下のコードは、20の角丸めを正方形画像に適用します：

source: The following code shows how to create a preview provider that previews a view called MyView for iPhone X:
ja: 以下のコードは、あるプレビュープロバイダを作成する方法を示します、それはMyViewと呼ばれるビューをiPhone Xに対してプレビューします：

source: The following code uses this method to test whether all the names in an array have at least five characters:
ja: 以下のコードはこのメソッドを使って、配列の中の全ての名前が少なくとも５つの文字を持つかどうかを試験します：

source: The following creates a tab view with three tabs:
ja: 以下は、あるタブビューは３つのタブで作成します：

source: The following error codes are defined by NSXMLParser.
ja: 以下のエラーコードは、NSXMLParserによって定義されます。

source: The following example adds a dashed purple stroke to a Capsule:
ja: 以下の例は、中線（ダッシュ）の紫の筆致をCapsuleに加えます：

source: The following example creates a Text view with a contextual menu.
ja: 以下の例は、Textビューをあるコンテキストによるメニューで作成します。

source: The following example creates text with a contextual menu:
ja: 以下の例は、テキストをあるコンテキストによるメニューで作成します：

source: The following example defines a new value transformer that takes an object and returns a string based on the object’s class type.
ja: 以下の例は、ある新しい値変換器を定義します、それはあるオブジェクトを取り、そのオブジェクトのもつクラス型に基づいてある文字列を返します。

source: The following example obtains an index advanced four positions from an array’s starting index and then prints the element at that position.
ja: 以下の例は、配列の始まりから４位置進んだインデックスを入手して、それからその位置での要素を出力します。

source: The following example only pads the horizontal edge insets:
ja: 以下の例は、水平縁差込を詰め込むだけです：

source: The following example renders two circles.
ja: 以下の例は、２つの円を描出します。

source: The following example rotates a square by 45 degrees to create a diamond shape:
ja: 以下の例は、正方形を45度回転してダイヤモンド形を作成します：

source: The following example rotates a square by 45 degrees to the right to create a diamond shape:
ja: 以下の例は、ある正方形を45度だけ右に回転して、ひし形を作成します：

source: The following example searches for the index of the number 40 in an array of integers, and then prints the suffix of the array starting at that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスで始まる配列の末尾を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, and including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、そしてそれを含めて、配列の冒頭を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, but not including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、しかしそれを含めずに、配列の冒頭を出力します。

source: The following example shows a simplified infinity symbol that draws only three quarters of the full shape.
ja: 以下の例は、ある簡略化された無限記号を示します、それは完全な形状の四半分を３つだけ描画します。

source: The following example shows how an array of strings can be joined to a single, comma-separated string:
ja: 以下の例は、どのように文字列からなる配列が単一の、コンマ区切りの文字列へと連結できるかを示します：

source: The following example shows the inclusion of a custom MyRepresentedCustomView struct in the view hierarchy.
ja: 以下の例は、あつらえのMyRepresentedCustomView structの包含物をビュー階層において示します。
